; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	spectrograph4 - mode
	spectrograph0 - mode
	spectrograph1 - mode
	thermograph2 - mode
	infrared3 - mode
	GroundStation4 - direction
	Star2 - direction
	Star5 - direction
	Star1 - direction
	Star3 - direction
	Star0 - direction
	Phenomenon6 - direction
	Star7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation4)
	(calibration_target instrument0 Star5)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
	(supports instrument1 infrared3)
	(supports instrument1 thermograph2)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 Star1)
	(calibration_target instrument1 Star5)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 Star1)
	(calibration_target instrument2 Star5)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star1)
	(supports instrument3 thermograph2)
	(supports instrument3 spectrograph4)
	(supports instrument3 infrared3)
	(calibration_target instrument3 Star5)
	(calibration_target instrument3 Star2)
	(supports instrument4 spectrograph1)
	(supports instrument4 infrared3)
	(calibration_target instrument4 Star1)
	(supports instrument5 spectrograph4)
	(supports instrument5 spectrograph0)
	(calibration_target instrument5 Star0)
	(calibration_target instrument5 Star3)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star2)
)
(:goal (and
	(pointing satellite0 Phenomenon9)
	(pointing satellite2 Star0)
	(have_image Phenomenon6 thermograph2)
	(have_image Star7 spectrograph1)
	(have_image Star8 thermograph2)
	(have_image Phenomenon9 thermograph2)
	(have_image Phenomenon10 spectrograph4)
	(have_image Phenomenon11 spectrograph1)
))

)

; plan
1. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 0 of 8
2. (calibrate satellite2 instrument3 star2)
   added: (calibrated instrument3)
   goals met: 0 of 8
3. (turn_to satellite2 phenomenon6 star2)
   deleted: (pointing satellite2 star2)
   added: (pointing satellite2 phenomenon6)
   goals met: 0 of 8
4. (take_image satellite2 phenomenon6 instrument3 thermograph2)
   added: (have_image phenomenon6 thermograph2)
   goals met: 1 of 8
5. (turn_to satellite2 phenomenon10 phenomenon6)
   deleted: (pointing satellite2 phenomenon6)
   added: (pointing satellite2 phenomenon10)
   goals met: 1 of 8
6. (turn_to satellite0 phenomenon9 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon9)
   goals met: 2 of 8
7. (take_image satellite2 phenomenon10 instrument3 spectrograph4)
   added: (have_image phenomenon10 spectrograph4)
   goals met: 3 of 8
8. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 3 of 8
9. (calibrate satellite1 instrument2 star1)
   added: (calibrated instrument2)
   goals met: 3 of 8
10. (turn_to satellite1 phenomenon11 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 phenomenon11)
   goals met: 3 of 8
11. (take_image satellite1 phenomenon11 instrument2 spectrograph1)
   added: (have_image phenomenon11 spectrograph1)
   goals met: 4 of 8
12. (turn_to satellite1 star7 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 star7)
   goals met: 4 of 8
13. (take_image satellite1 star7 instrument2 spectrograph1)
   added: (have_image star7 spectrograph1)
   goals met: 5 of 8
14. (turn_to satellite2 phenomenon9 phenomenon10)
   deleted: (pointing satellite2 phenomenon10)
   added: (pointing satellite2 phenomenon9)
   goals met: 5 of 8
15. (take_image satellite2 phenomenon9 instrument3 thermograph2)
   added: (have_image phenomenon9 thermograph2)
   goals met: 6 of 8
16. (turn_to satellite2 star8 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 star8)
   goals met: 6 of 8
17. (take_image satellite2 star8 instrument3 thermograph2)
   added: (have_image star8 thermograph2)
   goals met: 7 of 8
18. (turn_to satellite2 star0 star8)
   deleted: (pointing satellite2 star8)
   added: (pointing satellite2 star0)
   goals met: 8 of 8
